Revit 2027 API
BoundingBoxXYZ.BoundEnabled Property
Indexed access for loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool this[
	int bound,
	int dim
] { get; set; }
Public Property BoundEnabled (
	bound As Integer,
	dim As Integer
) As Boolean
	Get
	Set
public:
property bool BoundEnabled[int bound, int dim] {
	bool get (int bound, int dim);
	void set (int bound, int dim, bool value);
}
member BoundEnabled : bool with get, set
Parameters
bound Int32
dim Int32
Property Value
Boolean
Remarks
For bound, use 0 for Min and 1 for Max. For dimension, use 0 for X, 1 for Y and 2 for Z. The entire box must be enabled to have enabled individual bounds.
See Also
Reference
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace